nc: 4 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  l: [1.00, 1.00, 1024] # YOLOv8l summary: 365 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPs

# YOLOv8.0n backbone
backbone:

  - [-1, 1, Conv, [32, 3, 2]]          # 0-P1/2, c_out=32
  - [-1, 1, EG_stem, []]                 #1
  - [1, 1, Eage_detect, []]              # 2
  - [1, 1, Conv, [64, 3, 2]]          # 3-P2/4, c_out=64
  # EGA Layer
  - [-1, 1, EGA, [64]]                 # 4

  
  - [-1, 1, CSP_DenseRepViTBlock_, [64, 64, 3, False, 0.9, 1, False]] # 5
  - [[2, -1], 1, Edge_guide, [64]]                #6
  - [[5, -1], 1, Fuse_Features, [64]]             #7

  
  - [-1, 1, RepViTBlock, [128, True, 2, False]] # 8
  - [-1, 1, CSP_DenseRepViTBlock_, [128, 128, 3, False, 0.9, 1, False]] # 9
  - [[-1, 6], 1, Fuse_Features, [128]]     #10
  - [-1, 1, RepViTBlock, [256, False, 2]]       # 11
  - [-1, 1, CSP_DenseRepViTBlock, [256, 256, 3, True, 0.9]] # 12
  - [-1, 1, CSP_DenseRepViTBlock, [256, 256, 3, True, 0.9]] # 13
  - [[-1, 6], 1, Fuse_Features, [256]]            #14
  - [-1, 1, RepViTBlock, [512, False, 2]]       # 15
  - [-1, 1, CSP_DenseRepViTBlock_, [512, 512, 3, True, 0.9]] # 16
  - [[-1, 6], 1, Fuse_Features, [512]]             #17

  - [-1, 1, SPPF, [512, 5]]                      # 18
  - [-1, 1, PSA, [512]]                          # 19

# Head Configuration
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]           # 20 
  - [[-1, 14], 1, Concat, [1]]                           # 21 
  - [-1, 1, Conv, [256, 1, 1]]                           # 22 
  - [-1, 1, Context_Exploration_Block, []]               # 23

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]           # 24 
  - [[-1, 10], 1, Concat, [1]]                            # 25 
  - [-1, 1, Conv, [128, 1, 1]]                           # 26 
  - [-1, 1, Context_Exploration_Block, []]               # 27  P3/8-small

  - [-1, 1, Conv, [256, 3, 2]]                           # 28 
  - [[-1, 23], 1, Concat, [1]]                           # 29 
  - [-1, 1, Conv, [256, 1, 1]]                           # 30 
  - [-1, 1, Context_Exploration_Block, []]               # 31  P4/16-medium

  - [-1, 1, SCDown, [512, 3, 2]]                         # 32 
  - [[-1, 19], 1, Concat, [1]]                           # 33 
  - [-1, 1, Conv, [512, 1, 1]]                           # 34 
  - [-1, 1, Context_Exploration_Block, []]               # 35 P5/32-large

  # Detect Layer
  - [[27, 31, 35], 1, v10Detect, [nc]]  # Detect(P3, P4, P5)

