nc: 4 # number of classes
scales:
  l: [1.00, 1.00, 1024]

# Custom backbone
backbone:
  - [-1, 1, Conv, [32, 3, 2]]          # 0-P1/2
  - [-1, 1, EG_stem, []]               # 1
  - [1, 1, Conv, [64, 3, 2]]           # 2-P2/4
  - [-1, 1, EGA, [64]]                 # 3
  - [-1, 1, CSP_DenseRepViTBlock_, [64, 64, 3, False, 0.9, 1, False]] # 4
  - [[1, -1], 1, Edge_guide, [64]]    # 5
  - [[4, -1], 1, Fuse_Features, [64]] # 6
  - [-1, 1, RepViTBlock, [128, True, 2, False]] # 7
  - [-1, 1, CSP_DenseRepViTBlock_, [128, 128, 3, False, 0.9, 1, False]] # 8
  - [[-1, 5], 1, Fuse_Features, [128]] # 9 (P3-equivalent output for neck)
  - [-1, 1, RepViTBlock, [256, False, 2]]       # 10
  - [-1, 1, CSP_DenseRepViTBlock, [256, 256, 3, True, 0.9]] # 11
  - [-1, 1, CSP_DenseRepViTBlock, [256, 256, 3, True, 0.9]] # 12
  - [[-1, 5], 1, Fuse_Features, [256]] # 13 (P4-equivalent output for neck)
  - [-1, 1, RepViTBlock, [512, False, 2]]       # 14
  - [-1, 1, CSP_DenseRepViTBlock_, [512, 512, 3, True, 0.9]] # 15
  - [[-1, 5], 1, Fuse_Features, [512]] # 16
  - [-1, 1, SPPF, [512, 5]]            # 17
  - [-1, 1, PSA, [512]]                # 18 (P5-equivalent output for neck)

# YOLOv10 head (neck), adapted for the custom backbone
head:
  # FPN Path (Top-down)
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]           # 19 (from layer 18)
  - [[-1, 13], 1, Concat, [1]] # 20: cat Upsampled P5 (512ch) + Backbone P4 (256ch)
  - [-1, 3, C2fCIB, [256, True]] # 21: Neck P4 output (256ch)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]           # 22 (from layer 21)
  - [[-1, 9], 1, Concat, [1]] # 23: cat Upsampled Neck P4 (256ch) + Backbone P3 (128ch)
  - [-1, 3, C2f, [128]] # 24: P3_out for Detect head (128ch)

  # PAN Path (Bottom-up)
  - [-1, 1, Conv, [128, 3, 2]]                           # 25: Downsample P3_out
  - [[-1, 21], 1, Concat, [1]]                           # 26: cat Downsampled P3_out (128ch) + Neck P4 (256ch)
  - [-1, 3, C2fCIB, [256, True]] # 27: P4_out for Detect head (256ch)

  - [-1, 1, SCDown, [256, 3, 2]]                         # 28: Downsample P4_out
  - [[-1, 18], 1, Concat, [1]]                           # 29: cat Downsampled P4_out (256ch) + Backbone P5 (512ch)
  - [-1, 3, C2fCIB, [512, True]] # 30: P5_out for Detect head (512ch)

  # Detect Layer
  - [[24, 27, 30], 1, v10Detect, [nc]]  # Detect(P3, P4, P5)