# Ultralytics YOLO 🚀, AGPL-3.0 license

# Parameters
nc: 4 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  l: [1.00, 1.00, 1024]

# YOLOv10 backbone (Custom)
backbone:
  - [-1, 1, Conv, [32, 3, 2]]          # 0-P1/2, c_out=32
  - [-1, 1, EG_stem, []]               # 1
  - [1, 1, Conv, [64, 3, 2]]           # 2-P2/4, c_out=64
  - [-1, 1, EGA, [64]]                 # 3
  - [-1, 1, CSP_DenseRepViTBlock_, [64, 64, 3, True, 0.9, 1, False]] # 4
  - [[1, -1], 1, Edge_guide, [64]]    # 5
  - [[4, -1], 1, Fuse_Features, [64]] # 6
  - [-1, 1, RepViTBlock, [128, True, 2, False]] # 7
  - [-1, 1, CSP_DenseRepViTBlock_, [128, 128, 3, True, 0.9, 1, False]] # 8
  - [[-1, 5], 1, Fuse_Features, [128]] # 9 (P3/8 output)
  - [-1, 1, RepViTBlock, [256, True, 2]]       # 10
  - [-1, 1, CSP_DenseRepViTBlock_LK, [256, 256, 3, True, 0.9, 1, True, 7]] # 11
  - [-1, 1, CSP_DenseRepViTBlock_LK, [256, 256, 3, True, 0.9, 1, True, 7]] # 12
  - [[-1, 5], 1, Fuse_Features, [256]] # 13 (P4/16 output)
  - [-1, 1, RepViTBlock, [512, True, 2]]       # 14
  - [-1, 1, CSP_DenseRepViTBlock_lK, [512, 512, 3, True, 0.9, 1, True, 7]] # 15
  - [-1, 1, SPPF, [512, 5]]            # 16
  - [-1, 1, PSA, [512]]                # 17 (P5/32 output)

# YOLOv10 PAN-FPN Neck
head:
  # FPN Path (Top-down)
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]           # 18 (from layer 17)
  - [[-1, 13], 1, Concat, [1]] # 19: cat Upsampled P5 (512ch) + Backbone P4 (256ch)
  - [-1, 3, C2fCIB, [256, True]] # 20: Neck P4 output (256ch)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]           # 21 (from layer 20)
  - [[-1, 9], 1, Concat, [1]] # 22: cat Upsampled Neck P4 (256ch) + Backbone P3 (128ch)
  - [-1, 3, C2f, [128]] # 23: P3_out for Detect head (128ch)

  # PAN Path (Bottom-up)
  - [-1, 1, Conv, [128, 3, 2]]                           # 24: Downsample P3_out
  - [[-1, 20], 1, Concat, [1]]                           # 25: cat Downsampled P3_out (128ch) + Neck P4 (256ch)
  - [-1, 3, C2fCIB, [256, True]] # 26: P4_out for Detect head (256ch)

  - [-1, 1, SCDown, [256, 3, 2]]                         # 27: Downsample P4_out
  - [[-1, 17], 1, Concat, [1]]                           # 28: cat Downsampled P4_out (256ch) + Backbone P5 (512ch)
  - [-1, 3, C2fCIB, [512, True]] # 29: P5_out for Detect head (512ch)

  # Detect Layer
  - [[23, 26, 29], 1, v10Detect, [nc]]  # Detect(P3, P4, P5)