nc: 4 # number of classes
scales:
  l: [1.00, 1.00, 1024]

# Custom backbone (Correctly re-numbered)
backbone:
  - [-1, 1, Conv, [32, 3, 2]]          # 0-P1/2
  - [-1, 1, EG_stem, []]               # 1
  - [-1, 1, Conv, [64, 3, 2]]           # 2-P2/4
  - [-1, 1, EGA, [64]]                 # 3
  - [[1, -1], 1, Edge_guide, [64]]    # 4
  - [-1, 1, DenseRepViTBlock_, [64, 64, 3, True, 1, False]] # 5, Replaced
  - [[-1, 4], 1, Fuse_Features, [64]] # 6
  - [-1, 1, RepViTBlock, [128, True, 2, False]] # 7
  - [-1, 1, DenseRepViTBlock_, [128, 128, 3, True, 1, False]] # 8, Replaced
  - [[-1, 4], 1, Fuse_Features, [128]] # 9 (P3-equivalent output for neck)
  - [-1, 1, RepViTBlock, [256, True, 2]]       # 10
  - [-1, 1, DenseRepViTBlock, [256, 256, 3, True, 1, True]] # 11, Replaced
  - [-1, 1, DenseRepViTBlock, [256, 256, 3, True, 1, True]] # 12, Replaced
  - [[-1, 4], 1, Fuse_Features, [256]] # 13 (P4-equivalent output for neck)
  - [-1, 1, RepViTBlock, [512, True, 2]]       # 14
  - [-1, 1, DenseRepViTBlock_, [512, 512, 3, True, 1, True]] # 15, Replaced
  - [[-1, 4], 1, Fuse_Features, [512]] # 16 (This is the newly added layer)
  - [-1, 1, SPPF, [512, 5]]            # 17 (was 16)
  - [-1, 1, PSA, [512]]                # 18 (was 17) (P5-equivalent output for neck)

# YOLOv10 head (neck), with corrected layer references
head:
  # FPN Path (Top-down)
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]           # 19 (was 18) (from layer 18)
  - [[-1, 13], 1, Concat, [1]] # 20 (was 19): cat Upsampled P5 + Backbone P4 (from new layer 13)
  - [-1, 3, C2fCIB, [256, True]] # 21 (was 20): Neck P4 output

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]           # 22 (was 21) (from layer 21)
  - [[-1, 9], 1, Concat, [1]] # 23 (was 22): cat Upsampled Neck P4 + Backbone P3 (from new layer 9)
  - [-1, 3, C2f, [128]] # 24 (was 23): P3_out for Detect head

  # PAN Path (Bottom-up)
  - [-1, 1, Conv, [128, 3, 2]]                           # 25 (was 24): Downsample P3_out
  - [[-1, 21], 1, Concat, [1]]                           # 26 (was 25): cat Downsampled P3_out + Neck P4 (from new layer 21)
  - [-1, 3, C2fCIB, [256, True]] # 27 (was 26): P4_out for Detect head

  - [-1, 1, SCDown, [256, 3, 2]]                         # 28 (was 27): Downsample P4_out
  - [[-1, 18], 1, Concat, [1]]                           # 29 (was 28): cat Downsampled P4_out + Backbone P5 (from new layer 18)
  - [-1, 3, C2fCIB, [512, True]] # 30 (was 29): P5_out for Detect head

  # Detect Layer
  - [[24, 27, 30], 1, Detect, [nc]]  # 31 (was 30): Detect(P3, P4, P5)