nc: 4
scales:
  l: [1.00, 1.00, 1024]

backbone:
  # [from, number, module, args]
  - [-1, 1, Conv, [32, 3, 2]]                                # 0-P1/2
  - [-1, 1, EG_stem, []]                                     # 1
  - [1, 1, Eage_detect, []]                                  # 2 
  - [1, 1, Conv, [64, 3, 2]]                                 # 3-P2/4
  - [-1, 1, EGA, [64]]                                       # 4
  - [-1, 1, DenseRepViTBlock_, [64, 64, 3, False, 1, False]]   # 5
  - [[2, -1], 1, Edge_guide, [64]]                           # 6
  - [[5, -1], 1, Fuse_Features, [64]]                        # 7
  - [-1, 1, RepViTBlock, [128, True, 2, False]]              # 8
  - [-1, 1, DenseRepViTBlock_, [128, 128, 3, False, 1, False]] # 9
  - [[-1, 6], 1, Fuse_Features, [128]]                       # 10
  - [-1, 1, RepViTBlock, [256, False, 2]]                    # 11
  - [-1, 1, DenseRepViTBlock, [256, 256, 2, True]]            # 12
  - [-1, 1, DenseRepViTBlock, [256, 256, 2, True]]            #13
  - [[-1, 10], 1, Fuse_Features, [256]]                       # 14 (原第14层)
  - [-1, 1, RepViTBlock, [512, False, 2]]                    # 15 (原第15层)
  - [-1, 1, DenseRepViTBlock_, [512, 512, 2, True]]           # 16 (原第16层)
  - [[-1, 13], 1, Fuse_Features, [512]]                       # 17 (原第17层)
  - [-1, 1, SPPF, [512, 5]]                                  # 18(原第18层)
  - [-1, 1, PSA, [512]]                                      # 19 (原第19层)

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]               # 20 (原第20层)
  - [[-1, 13], 1, Concat, [1]]                               # 21 (原第21层, 连接14->13)
  - [-1, 1, Conv, [256, 1, 1]]                               # 22 (原第22层)
  - [-1, 1, Context_Exploration_Block, []]                   # 23 (原第23层)
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]               # 24 (原第24层)
  - [[-1, 10], 1, Concat, [1]]                               # 25 (原第25层, 连接10不变)
  - [-1, 1, Conv, [128, 1, 1]]                               # 26 (原第26层)
  - [-1, 1, Context_Exploration_Block, []]                   # 27 (原第27层) P3/8
  - [-1, 1, Conv, [256, 3, 2]]                               # 28 (原第28层)
  - [[-1, 22], 1, Concat, [1]]                               # 29 (原第29层, 连接23->22)
  - [-1, 1, Conv, [256, 1, 1]]                               # 30 (原第30层)
  - [-1, 1, Context_Exploration_Block, []]                   # 31 (原第31层) P4/16
  - [-1, 1, SCDown, [512, 3, 2]]                             # 32 (原第32层)
  - [[-1, 19], 1, Concat, [1]]                               # 33 (原第33层, 连接19->18)
  - [-1, 1, Conv, [512, 1, 1]]                               # 34 (原第34层)
  - [-1, 1, Context_Exploration_Block, []]                   # 35 (原第35层) P5/32
  - [[27, 31, 35], 1, v10Detect, [nc]]                       # 36 (连接27,31,35 -> 26,30,34)