# Parameters
nc: 4 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  l: [1.00, 1.00, 512] # YOLOv8l summary: 365 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPs

# YOLOv8.0n backbone
backbone:
  # Stem (emulating RepViT patch_embed)
  - [-1, 1, Conv, [32, 3, 2]]          # 0-P1/2, c_out=32
  - [-1, 1, Conv, [64, 3, 2]]          # 1-P2/4, c_out=64

  # 阶段 1 (P2/4, 输入通道=64) - 基于 cfgs[0:3]
  # 原始 cfgs: [k, t, c, SE, HS, s]
  # 简化后 YAML: [c2, use_se布尔值, (可选)步长, (可选)use_hs布尔值]


  # cfgs[0]: [64, 1, 1, 0] -> c2=64, se=True, stride=1, hs=False
  - [-1, 1, RepViTBlock, [64, True, 1, False]]  # 2: c2=64, use_se=True, stride=1 (must specify as hs is False), use_hs=False
  # cfgs[1]: [64, 1, 0, 0] -> c2=64, se=False, stride=1, hs=False
  - [-1, 1, RepViTBlock, [64, False, 1, False]] # 3: c2=64, use_se=False, stride=1 (must specify as hs is False), use_hs=False
  # cfgs[2]: [64, 1, 0, 0] -> c2=64, se=False, stride=1, hs=False
  - [-1, 1, RepViTBlock, [64, False, 1, False]] # 4: c2=64, use_se=False, stride=1 (must specify as hs is False), use_hs=False

  # Stage 2 (P3/8, c_in=64 for first block, then 128) - Based on cfgs[3:7]
  # cfgs[3]: [128, 2, 0, 0] -> c2=128, se=False, stride=2, hs=False
  - [-1, 1, RepViTBlock, [128, False, 2, False]] # 5: c2=128, use_se=False, stride=2, use_hs=False (Downsample)
  # cfgs[4]: [128, 1, 1, 0] -> c2=128, se=True, stride=1, hs=False
  - [-1, 1, RepViTBlock, [128, True, 1, False]]  # 6: c2=128, use_se=True, stride=1 (must specify as hs is False), use_hs=False
  # cfgs[5]: [128, 1, 0, 0] -> c2=128, se=False, stride=1, hs=False
  - [-1, 1, RepViTBlock, [128, False, 1, False]] # 7: c2=128, use_se=False, stride=1 (must specify as hs is False), use_hs=False
  # cfgs[6]: [128, 1, 0, 0] -> c2=128, se=False, stride=1, hs=False
  - [-1, 1, RepViTBlock, [128, False, 1, False]] # 8: c2=128, use_se=False, stride=1 (must specify as hs is False), use_hs=False

  # Stage 3 (P4/16, c_in=128 for first block, then 256) - Based on cfgs[7:19]
  # cfgs[7]: [256, 2, 0, 1] -> c2=256, se=False, stride=2, hs=True
  - [-1, 1, RepViTBlock, [256, False, 2]]       # 9: c2=256, use_se=False, stride=2 (hs=True is default) (Downsample)
  # cfgs[8]: [256, 1, 1, 1] -> c2=256, se=True, stride=1, hs=True
  - [-1, 1, RepViTBlock, [256, True]]           # 10: c2=256, use_se=True (stride=1, hs=True are defaults)
  # cfgs[9]: [256, 1, 0, 1] -> c2=256, se=False, stride=1, hs=True
  - [-1, 1, RepViTBlock, [256, False]]          # 11: c2=256, use_se=False (stride=1, hs=True are defaults)
  - [-1, 1, RepViTBlock, [256, True]]           # 12: from cfgs[10]
  - [-1, 1, RepViTBlock, [256, False]]          # 13: from cfgs[11]
  - [-1, 1, RepViTBlock, [256, True]]           # 14: from cfgs[12]
  - [-1, 1, RepViTBlock, [256, False]]          # 15: from cfgs[13]
  - [-1, 1, RepViTBlock, [256, True]]           # 16: from cfgs[14]
  - [-1, 1, RepViTBlock, [256, False]]          # 17: from cfgs[15]
  - [-1, 1, RepViTBlock, [256, True]]           # 18: from cfgs[16]
  - [-1, 1, RepViTBlock, [256, False]]          # 19: from cfgs[17]
  - [-1, 1, RepViTBlock, [256, False]]          # 20: from cfgs[18]
  - [-1, 1, RepViTBlock, [256, False]]          # 21: from cfgs[19] (original note: "Added below")

  # Stage 4 (P5/32, c_in=256 for first block, then 512) - Based on cfgs[20:23]
  # cfgs[20]: [512, 2, 0, 1] -> c2=512, se=False, stride=2, hs=True
  - [-1, 1, RepViTBlock, [512, False, 2]]       # 22: c2=512, use_se=False, stride=2 (hs=True is default) (Downsample)
  # cfgs[21]: [512, 1, 1, 1] -> c2=512, se=True, stride=1, hs=True
  - [-1, 1, RepViTBlock, [512, True]]           # 23: c2=512, use_se=True (stride=1, hs=True are defaults)
  # cfgs[22]: [512, 1, 0, 1] -> c2=512, se=False, stride=1, hs=True
  - [-1, 1, RepViTBlock, [512, False]]          # 24: c2=512, use_se=False (stride=1, hs=True are defaults)
  - [-1, 1, SPPF, [512, 5]]
  - [-1, 1, PSA, [512]] 

  # Standard YOLO head can follow. For example:
  # - [-1, 1, SPPF, [512, 5]] # if c_out of last RepViTBlock is 512
# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 21], 1, Concat, [1]] # cat backbone P4
  - [-1, 3, C2fCIB, [256, True]] # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 8], 1, Concat, [1]] # cat backbone P3
  - [-1, 3, C2f, [128]] # 16 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 29], 1, Concat, [1]] # cat head P4
  - [-1, 3, C2fCIB, [256, True]] # 19 (P4/16-medium)

  - [-1, 1, SCDown, [512, 3, 2]]
  - [[-1, 26], 1, Concat, [1]] # cat head P5
  - [-1, 3, C2fCIB, [512, True]] # 22 (P5/32-large)

  - [[32, 35, 38], 1, Detect, [nc]] # Detect(P3, P4, P5)
