nc: 4 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  l: [1.00, 1.00, 1024] # YOLOv8l summary: 365 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPs

backbone:
  # Stem           
  - [-1, 1, Conv, [32, 3, 2]]      # 0 -P1/2, c_out=32 
  - [-1, 1, EG_stem, []]           # 1            
  - [-1, 1, Conv, [64, 3, 2]]      # 2-P2/4, c_out=64

  # EGA Layer
  - [-1, 1, EGA, [64]]                 # 3 - c_in=64, c_out=64

  # Stage 1 (P2/4)
  - [-1, 1, DenseRepViTBlock_EGA, [64, 64, 3, True, 1, False]] # 4

  # Stage 2 (P3/8)
  - [-1, 1, RepViTBlock, [128, True, 2, False]] # 5
  - [-1, 1, DenseRepViTBlock_, [128, 128, 3, False, 1, False]] # 6

  # Stage 3 (P4/16)
  - [-1, 1, RepViTBlock, [256, False, 2]]       # 7
  - [-1, 1, DenseRepViTBlock, [256, 256, 3, True]] # 8
  - [-1, 1, DenseRepViTBlock, [256, 256, 3, True]] # 9

  # Stage 4 (P5/32)
  - [-1, 1, RepViTBlock, [512, False, 2]]       # 10
  - [-1, 1, DenseRepViTBlock_, [512, 512, 3, True]] # 11
  
  - [-1, 1, SPPF, [512, 5]]                      # 12
  - [-1, 1, PSA, [512]]                          # 13

# Head
head:
  # from, number, module, args
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]           # 14
  - [[-1, 9], 1, Concat, [1]]                            # 15 (cat backbone P4)
  - [-1, 1, Conv, [256, 1, 1]]                           # 16 (Bottleneck)
  # 更改: 移除了显式的 [0.6] 参数，使其使用您在代码中定义的默认值 e=0.5
  - [-1, 1, Context_Exploration_Block, []]               # 17

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]           # 18
  - [[-1, 6], 1, Concat, [1]]                            # 19 (cat backbone P3)
  - [-1, 1, Conv, [128, 1, 1]]                           # 20 (Bottleneck)
  # 更改: 移除了显式的 [0.6] 参数
  - [-1, 1, Context_Exploration_Block, []]               # 21

  - [-1, 1, Conv, [256, 3, 2]]                           # 22
  - [[-1, 17], 1, Concat, [1]]                           # 23 (cat head P4)
  - [-1, 1, Conv, [256, 1, 1]]                           # 24 (Bottleneck)
  # 更改: 移除了显式的 [0.6] 参数
  - [-1, 1, Context_Exploration_Block, []]               # 25

  - [-1, 1, SCDown, [512, 3, 2]]                         # 26
  - [[-1, 13], 1, Concat, [1]]                           # 27 (cat backbone P5)
  - [-1, 1, Conv, [512, 1, 1]]                           # 28 (Bottleneck)
  # 更改: 移除了显式的 [0.6] 参数
  - [-1, 1, Context_Exploration_Block, []]               # 29

  # Detect Layer
  - [[21, 25, 29], 1, v10Detect, [nc]]  # Detect(P3, P4, P5)

