nc: 4 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  l: [1.00, 1.00, 1024] # YOLOv8l summary: 365 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPs

# YOLOv8.0n backbone
backbone:
  # Stem (emulating RepViT patch_embed)
  - [-1, 1, Conv, [32, 3, 2]]          # 0-P1/2, c_out=32
  - [-1, 1, EG_stem, []]               # 1
  - [-1, 1, Conv, [64, 3, 2]]          # 2-P2/4, c_out=64
  # EGA Layer
  - [-1, 1, EGA, [64]]                 # 3

  # 阶段 1 (P2/4, c_in=64) -> 合并 3 个 RepViTBlock
  # 原始: 3 个 RepViTBlock, c2=64, 第一个 use_se=True
  # 新:   1 个 DenseRepViTBlock, constant=64, num_layers=3
  # args:         [c2, constant, num_layers, use_se, stride, use_hs]
  - [-1, 1, DenseRepViTBlock_, [64, 64, 3, False, 1, False]] # 4

  # Stage 2 (P3/8, c_in=64, c_out=128)
  # 下采样层保持不变
  - [-1, 1, RepViTBlock, [128, True, 2, False]] # 5
  # 合并 3 个 RepViTBlock
  # 原始: 3 个 RepViTBlock, c2=128, 第一个 use_se=True
  # 新:   1 个 DenseRepViTBlock, constant=128, num_layers=3
  # args:         [c2, constant, num_layers, use_se, stride, use_hs]
  - [-1, 1, DenseRepViTBlock_, [128, 128, 3, False, 1, False]] # 6

  # Stage 3 (P4/16, c_in=128, c_out=256)
  # 下采样层保持不变
  - [-1, 1, RepViTBlock, [256, False, 2]]       # 7
  # 合并 12 个 RepViTBlock
  # 原始: 12 个 RepViTBlock, c2=256, use_se交替出现, use_hs=True
  # 新:   1 个 DenseRepViTBlock, constant=256, num_layers=12
  # Note: 对于 use_se, 我们取第一个块的配置(True)作为整个密集块的配置
  # args:         [c2, constant, num_layers, use_se] (stride和hs使用默认值)
  - [-1, 1, DenseRepViTBlock, [256, 256, 3, True]] # 8
  - [-1, 1, DenseRepViTBlock, [256, 256, 3, True]] # 9

  # Stage 4 (P5/32, c_in=256, c_out=512)
  # 下采样层保持不变
  - [-1, 1, RepViTBlock, [512, False, 2]]       # 10
  # 合并 2 个 RepViTBlock
  # 原始: 2 个 RepViTBlock, c2=512, 第一个 use_se=True
  # 新:   1 个 DenseRepViTBlock, constant=512, num_layers=2
  # args:         [c2, constant, num_layers, use_se]
  - [-1, 1, DenseRepViTBlock_, [512, 512, 3, True]] # 11

  # Stage 4 的结尾保持不变
  - [-1, 1, SPPF, [512, 5]]                      # 12
  - [-1, 1, PSA, [512]]                          # 13

  - [1, 1, Eage_detect, []]                     #14
  - [[-1, 4], 1, Edge_guide, [64]] #64,160              15
  # 最终的 Head 配置 (v2)
# Head Configuration
head:
  # from, number, module, args
  # 修正: 提供了两个参数 [c_mid, c_out]
  - [[13, 15], 1, Fuse_Features, [512]]                  # 16, Corrected: was [256, 512], now correctly [512]
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]           # 17
  
  # 修正: 提供了两个参数 [c_mid, c_out]
  - [[9, 15], 1, Fuse_Features, [256]]                   # 18, Corrected: was [128, 256], now correctly [256]
  - [[-1, 17], 1, Concat, [1]]                           # 19
  - [-1, 1, Conv, [256, 1, 1]]                           # 20 
  - [-1, 1, Context_Exploration_Block, []]               # 21

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]           # 22
  # 修正: 提供了两个参数 [c_mid, c_out]
  - [[6, 15], 1, Fuse_Features, [128]]                   # 23, Corrected: was [64, 128], now correctly [128]
  - [[-1, 22], 1, Concat, [1]]                           # 24
  - [-1, 1, Conv, [128, 1, 1]]                           # 25 
  - [-1, 1, Context_Exploration_Block, []]               # 26 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]                           # 27
  - [[-1, 21], 1, Concat, [1]]                           # 28
  - [-1, 1, Conv, [256, 1, 1]]                           # 29
  - [-1, 1, Context_Exploration_Block, []]               # 30 (P4/16-medium)

  - [-1, 1, SCDown, [512, 3, 2]]                         # 31
  - [[-1, 16], 1, Concat, [1]]                           # 32
  - [-1, 1, Conv, [512, 1, 1]]                           # 33
  - [-1, 1, Context_Exploration_Block, []]               # 34 (P5/32-large)

  # Detect Layer
  - [[26, 30, 34], 1, v10Detect, [nc]]  # Detect(P3, P4, P5)
